{"modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "time_distributed_input", "inbound_nodes": [], "config": {"sparse": false, "name": "time_distributed_input", "batch_input_shape": [null, 16, 32, 7], "dtype": "float32"}}, {"class_name": "TimeDistributed", "name": "time_distributed", "inbound_nodes": [[["time_distributed_input", 0, 0, {}]]], "config": {"dtype": "float32", "name": "time_distributed", "batch_input_shape": [null, 16, 32, 7], "trainable": true, "layer": {"class_name": "Conv1D", "config": {"name": "conv1d", "bias_constraint": null, "trainable": true, "dtype": null, "kernel_regularizer": null, "bias_regularizer": null, "filters": 16, "use_bias": true, "dilation_rate": [1], "activation": "linear", "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_size": [2], "data_format": "channels_last", "strides": [1], "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "name": "time_distributed_1", "inbound_nodes": [[["time_distributed", 0, 0, {}]]], "config": {"name": "time_distributed_1", "dtype": "float32", "trainable": true, "layer": {"class_name": "MaxPooling1D", "config": {"padding": "valid", "name": "max_pooling1d", "trainable": true, "pool_size": [2], "dtype": null, "strides": [2]}}}}, {"class_name": "TimeDistributed", "name": "time_distributed_2", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "config": {"name": "time_distributed_2", "dtype": "float32", "trainable": true, "layer": {"class_name": "Activation", "config": {"activation": "relu", "name": "activation", "dtype": null, "trainable": true}}}}, {"class_name": "TimeDistributed", "name": "time_distributed_3", "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "config": {"name": "time_distributed_3", "dtype": "float32", "trainable": true, "layer": {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout", "trainable": true, "seed": null, "rate": 0.3, "dtype": null}}}}, {"class_name": "TimeDistributed", "name": "time_distributed_4", "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]], "config": {"name": "time_distributed_4", "dtype": "float32", "trainable": true, "layer": {"class_name": "Conv1D", "config": {"name": "conv1d_1", "bias_constraint": null, "trainable": true, "dtype": null, "kernel_regularizer": null, "bias_regularizer": null, "filters": 16, "use_bias": true, "dilation_rate": [1], "activation": "linear", "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_size": [3], "data_format": "channels_last", "strides": [1], "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "name": "time_distributed_5", "inbound_nodes": [[["time_distributed_4", 0, 0, {}]]], "config": {"name": "time_distributed_5", "dtype": "float32", "trainable": true, "layer": {"class_name": "MaxPooling1D", "config": {"padding": "valid", "name": "max_pooling1d_1", "trainable": true, "pool_size": [2], "dtype": null, "strides": [2]}}}}, {"class_name": "TimeDistributed", "name": "time_distributed_6", "inbound_nodes": [[["time_distributed_5", 0, 0, {}]]], "config": {"name": "time_distributed_6", "dtype": "float32", "trainable": true, "layer": {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "dtype": null, "trainable": true}}}}, {"class_name": "TimeDistributed", "name": "time_distributed_7", "inbound_nodes": [[["time_distributed_6", 0, 0, {}]]], "config": {"name": "time_distributed_7", "dtype": "float32", "trainable": true, "layer": {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null, "rate": 0.3, "dtype": null}}}}, {"class_name": "TimeDistributed", "name": "time_distributed_8", "inbound_nodes": [[["time_distributed_7", 0, 0, {}]]], "config": {"name": "time_distributed_8", "dtype": "float32", "trainable": true, "layer": {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten", "dtype": null, "trainable": true}}}}, {"class_name": "LSTM", "name": "lstm", "inbound_nodes": [[["time_distributed_8", 0, 0, {}]]], "config": {"units": 64, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "return_state": false, "trainable": true, "go_backwards": false, "bias_regularizer": null, "use_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "dtype": "float32", "bias_constraint": null, "implementation": 1, "name": "lstm", "recurrent_constraint": null, "stateful": false, "dropout": 0.0, "unroll": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "kernel_constraint": null}}, {"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 16, 7], "dtype": "float32"}}, {"class_name": "Concatenate", "name": "concatenate", "inbound_nodes": [[["lstm", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate", "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "name": "dense", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "config": {"units": 71, "name": "dense", "bias_constraint": null, "trainable": true, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"units": 71, "name": "dense_1", "bias_constraint": null, "trainable": true, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"units": 2, "name": "dense_2", "bias_constraint": null, "trainable": true, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}}, "kernel_regularizer": null, "kernel_constraint": null}}], "output_layers": [["dense_2", 0, 0]], "name": "model", "input_layers": [["time_distributed_input", 0, 0], ["input_1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1_momentum"], "weights": [{"name": "dense/kernel", "shape": [71, 71], "dtype": "float32"}, {"name": "dense/bias", "shape": [71], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [71, 71], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [71], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [71, 2], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [2], "dtype": "float32"}, {"name": "lstm/kernel", "shape": [96, 256], "dtype": "float32"}, {"name": "lstm/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "lstm/bias", "shape": [256], "dtype": "float32"}, {"name": "time_distributed/kernel", "shape": [2, 7, 16], "dtype": "float32"}, {"name": "time_distributed/bias", "shape": [16], "dtype": "float32"}, {"name": "time_distributed_4/kernel", "shape": [3, 16, 16], "dtype": "float32"}, {"name": "time_distributed_4/bias", "shape": [16], "dtype": "float32"}]}]}