{"modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"config": {"output_layers": [["dense_2", 0, 0]], "layers": [{"config": {"dtype": "float32", "name": "time_distributed_input", "batch_input_shape": [null, 16, 32, 7], "sparse": false}, "inbound_nodes": [], "name": "time_distributed_input", "class_name": "InputLayer"}, {"config": {"dtype": "float32", "trainable": true, "name": "time_distributed", "batch_input_shape": [null, 16, 32, 7], "layer": {"config": {"name": "conv1d", "dilation_rate": [1], "activation": "linear", "dtype": null, "strides": [1], "filters": 16, "data_format": "channels_last", "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [2], "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv1D"}}, "inbound_nodes": [[["time_distributed_input", 0, 0, {}]]], "name": "time_distributed", "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "trainable": true, "name": "time_distributed_1", "layer": {"config": {"pool_size": [2], "trainable": true, "name": "max_pooling1d", "dtype": null, "strides": [2], "padding": "valid"}, "class_name": "MaxPooling1D"}}, "inbound_nodes": [[["time_distributed", 0, 0, {}]]], "name": "time_distributed_1", "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "trainable": true, "name": "time_distributed_2", "layer": {"config": {"dtype": null, "trainable": true, "name": "activation", "activation": "relu"}, "class_name": "Activation"}}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "time_distributed_2", "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "trainable": true, "name": "time_distributed_3", "layer": {"config": {"trainable": true, "name": "dropout", "rate": 0.3, "noise_shape": null, "dtype": null, "seed": null}, "class_name": "Dropout"}}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "name": "time_distributed_3", "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "trainable": true, "name": "time_distributed_4", "layer": {"config": {"name": "conv1d_1", "dilation_rate": [1], "activation": "linear", "dtype": null, "strides": [1], "filters": 16, "data_format": "channels_last", "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3], "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv1D"}}, "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]], "name": "time_distributed_4", "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "trainable": true, "name": "time_distributed_5", "layer": {"config": {"pool_size": [2], "trainable": true, "name": "max_pooling1d_1", "dtype": null, "strides": [2], "padding": "valid"}, "class_name": "MaxPooling1D"}}, "inbound_nodes": [[["time_distributed_4", 0, 0, {}]]], "name": "time_distributed_5", "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "trainable": true, "name": "time_distributed_6", "layer": {"config": {"dtype": null, "trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}}, "inbound_nodes": [[["time_distributed_5", 0, 0, {}]]], "name": "time_distributed_6", "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "trainable": true, "name": "time_distributed_7", "layer": {"config": {"trainable": true, "name": "dropout_1", "rate": 0.3, "noise_shape": null, "dtype": null, "seed": null}, "class_name": "Dropout"}}, "inbound_nodes": [[["time_distributed_6", 0, 0, {}]]], "name": "time_distributed_7", "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "trainable": true, "name": "time_distributed_8", "layer": {"config": {"dtype": null, "trainable": true, "name": "flatten", "data_format": "channels_last"}, "class_name": "Flatten"}}, "inbound_nodes": [[["time_distributed_7", 0, 0, {}]]], "name": "time_distributed_8", "class_name": "TimeDistributed"}, {"config": {"stateful": false, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_constraint": null, "recurrent_dropout": 0.0, "return_sequences": true, "kernel_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "bias_regularizer": null, "return_state": false, "name": "lstm", "dropout": 0.0, "unroll": false, "recurrent_initializer": {"config": {"dtype": "float32", "seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 1, "trainable": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "activation": "tanh", "use_bias": true, "units": 64, "activity_regularizer": null}, "inbound_nodes": [[["time_distributed_8", 0, 0, {}]]], "name": "lstm", "class_name": "LSTM"}, {"config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 16, 7], "sparse": false}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"dtype": "float32", "trainable": true, "name": "concatenate", "axis": -1}, "inbound_nodes": [[["lstm", 0, 0, {}], ["input_1", 0, 0, {}]]], "name": "concatenate", "class_name": "Concatenate"}, {"config": {"name": "dense", "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 71, "trainable": true, "use_bias": true, "kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["concatenate", 0, 0, {}]]], "name": "dense", "class_name": "Dense"}, {"config": {"name": "dense_1", "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 71, "trainable": true, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["dense", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"name": "dense_2", "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 6, "trainable": true, "use_bias": true, "kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}], "name": "model", "input_layers": [["time_distributed_input", 0, 0], ["input_1", 0, 0]]}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense/kernel", "shape": [71, 71], "dtype": "float32"}, {"name": "dense/bias", "shape": [71], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [71, 71], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [71], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [71, 6], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [6], "dtype": "float32"}, {"name": "lstm/kernel", "shape": [96, 256], "dtype": "float32"}, {"name": "lstm/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "lstm/bias", "shape": [256], "dtype": "float32"}, {"name": "time_distributed/kernel", "shape": [2, 7, 16], "dtype": "float32"}, {"name": "time_distributed/bias", "shape": [16], "dtype": "float32"}, {"name": "time_distributed_4/kernel", "shape": [3, 16, 16], "dtype": "float32"}, {"name": "time_distributed_4/bias", "shape": [16], "dtype": "float32"}]}]}