{"modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"config": {"input_layers": [["time_distributed_input", 0, 0], ["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model", "layers": [{"name": "time_distributed_input", "config": {"dtype": "float32", "name": "time_distributed_input", "sparse": false, "batch_input_shape": [null, 16, 32, 2]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "time_distributed", "config": {"dtype": "float32", "trainable": true, "name": "time_distributed", "layer": {"config": {"bias_regularizer": null, "padding": "valid", "trainable": true, "use_bias": true, "strides": [1], "bias_constraint": null, "filters": 16, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d", "kernel_size": [2], "data_format": "channels_last", "dtype": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, "batch_input_shape": [null, 16, 32, 2]}, "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_input", 0, 0, {}]]]}, {"name": "time_distributed_1", "config": {"dtype": "float32", "trainable": true, "name": "time_distributed_1", "layer": {"config": {"dtype": null, "strides": [2], "pool_size": [2], "trainable": true, "name": "max_pooling1d", "padding": "valid"}, "class_name": "MaxPooling1D"}}, "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed", 0, 0, {}]]]}, {"name": "time_distributed_2", "config": {"dtype": "float32", "trainable": true, "name": "time_distributed_2", "layer": {"config": {"dtype": null, "activation": "relu", "name": "activation", "trainable": true}, "class_name": "Activation"}}, "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"name": "time_distributed_3", "config": {"dtype": "float32", "trainable": true, "name": "time_distributed_3", "layer": {"config": {"dtype": null, "noise_shape": null, "seed": null, "rate": 0.3, "trainable": true, "name": "dropout"}, "class_name": "Dropout"}}, "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]]}, {"name": "time_distributed_4", "config": {"dtype": "float32", "trainable": true, "name": "time_distributed_4", "layer": {"config": {"bias_regularizer": null, "padding": "valid", "trainable": true, "use_bias": true, "strides": [1], "bias_constraint": null, "filters": 16, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_1", "kernel_size": [3], "data_format": "channels_last", "dtype": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv1D"}}, "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]]}, {"name": "time_distributed_5", "config": {"dtype": "float32", "trainable": true, "name": "time_distributed_5", "layer": {"config": {"dtype": null, "strides": [2], "pool_size": [2], "trainable": true, "name": "max_pooling1d_1", "padding": "valid"}, "class_name": "MaxPooling1D"}}, "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_4", 0, 0, {}]]]}, {"name": "time_distributed_6", "config": {"dtype": "float32", "trainable": true, "name": "time_distributed_6", "layer": {"config": {"dtype": null, "activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}}, "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_5", 0, 0, {}]]]}, {"name": "time_distributed_7", "config": {"dtype": "float32", "trainable": true, "name": "time_distributed_7", "layer": {"config": {"dtype": null, "noise_shape": null, "seed": null, "rate": 0.3, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}}, "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_6", 0, 0, {}]]]}, {"name": "time_distributed_8", "config": {"dtype": "float32", "trainable": true, "name": "time_distributed_8", "layer": {"config": {"data_format": "channels_last", "dtype": null, "trainable": true, "name": "flatten"}, "class_name": "Flatten"}}, "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_7", 0, 0, {}]]]}, {"name": "lstm", "config": {"unroll": false, "recurrent_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "dtype": "float32", "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "activation": "tanh", "name": "lstm", "unit_forget_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "dropout": 0.0, "units": 64, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "implementation": 1, "activity_regularizer": null, "bias_constraint": null, "return_state": false, "recurrent_dropout": 0.0, "trainable": true, "stateful": false, "dtype": "float32", "kernel_constraint": null, "return_sequences": true}, "class_name": "LSTM", "inbound_nodes": [[["time_distributed_8", 0, 0, {}]]]}, {"name": "input_1", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 16, 7]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "concatenate", "config": {"axis": -1, "dtype": "float32", "trainable": true, "name": "concatenate"}, "class_name": "Concatenate", "inbound_nodes": [[["lstm", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"name": "dense", "config": {"bias_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "tanh", "name": "dense", "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "units": 71, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"name": "dense_1", "config": {"bias_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "name": "dense_1", "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "units": 71, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"name": "dense_2", "config": {"bias_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "tanh", "name": "dense_2", "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "units": 6, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}]}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense/kernel", "shape": [71, 71], "dtype": "float32"}, {"name": "dense/bias", "shape": [71], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [71, 71], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [71], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [71, 6], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [6], "dtype": "float32"}, {"name": "lstm/kernel", "shape": [96, 256], "dtype": "float32"}, {"name": "lstm/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "lstm/bias", "shape": [256], "dtype": "float32"}, {"name": "time_distributed/kernel", "shape": [2, 2, 16], "dtype": "float32"}, {"name": "time_distributed/bias", "shape": [16], "dtype": "float32"}, {"name": "time_distributed_4/kernel", "shape": [3, 16, 16], "dtype": "float32"}, {"name": "time_distributed_4/bias", "shape": [16], "dtype": "float32"}]}]}