{"modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["time_distributed_input", 0, 0], ["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 16, 32, 2], "name": "time_distributed_input"}, "name": "time_distributed_input"}, {"inbound_nodes": [[["time_distributed_input", 0, 0, {}]]], "class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Conv1D", "config": {"activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "conv1d", "padding": "valid", "filters": 16, "kernel_size": [2], "trainable": true, "dtype": null, "data_format": "channels_last", "strides": [1], "kernel_regularizer": null, "dilation_rate": [1]}}, "batch_input_shape": [null, 16, 32, 2], "trainable": true, "name": "time_distributed"}, "name": "time_distributed"}, {"inbound_nodes": [[["time_distributed", 0, 0, {}]]], "class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "MaxPooling1D", "config": {"padding": "valid", "pool_size": [2], "trainable": true, "dtype": null, "name": "max_pooling1d", "strides": [2]}}, "trainable": true, "name": "time_distributed_1"}, "name": "time_distributed_1"}, {"inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Activation", "config": {"dtype": null, "activation": "relu", "trainable": true, "name": "activation"}}, "trainable": true, "name": "time_distributed_2"}, "name": "time_distributed_2"}, {"inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "dtype": null, "rate": 0.3, "name": "dropout"}}, "trainable": true, "name": "time_distributed_3"}, "name": "time_distributed_3"}, {"inbound_nodes": [[["time_distributed_3", 0, 0, {}]]], "class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Conv1D", "config": {"activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "conv1d_1", "padding": "valid", "filters": 16, "kernel_size": [3], "trainable": true, "dtype": null, "data_format": "channels_last", "strides": [1], "kernel_regularizer": null, "dilation_rate": [1]}}, "trainable": true, "name": "time_distributed_4"}, "name": "time_distributed_4"}, {"inbound_nodes": [[["time_distributed_4", 0, 0, {}]]], "class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "MaxPooling1D", "config": {"padding": "valid", "pool_size": [2], "trainable": true, "dtype": null, "name": "max_pooling1d_1", "strides": [2]}}, "trainable": true, "name": "time_distributed_5"}, "name": "time_distributed_5"}, {"inbound_nodes": [[["time_distributed_5", 0, 0, {}]]], "class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Activation", "config": {"dtype": null, "activation": "relu", "trainable": true, "name": "activation_1"}}, "trainable": true, "name": "time_distributed_6"}, "name": "time_distributed_6"}, {"inbound_nodes": [[["time_distributed_6", 0, 0, {}]]], "class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "dtype": null, "rate": 0.3, "name": "dropout_1"}}, "trainable": true, "name": "time_distributed_7"}, "name": "time_distributed_7"}, {"inbound_nodes": [[["time_distributed_7", 0, 0, {}]]], "class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Flatten", "config": {"dtype": null, "data_format": "channels_last", "trainable": true, "name": "flatten"}}, "trainable": true, "name": "time_distributed_8"}, "name": "time_distributed_8"}, {"inbound_nodes": [[["time_distributed_8", 0, 0, {}]]], "class_name": "LSTM", "config": {"go_backwards": false, "recurrent_constraint": null, "unit_forget_bias": true, "use_bias": true, "activity_regularizer": null, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}}, "stateful": false, "dropout": 0.0, "return_sequences": true, "trainable": true, "name": "lstm", "recurrent_regularizer": null, "units": 64, "activation": "tanh", "bias_constraint": null, "return_state": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "implementation": 1, "dtype": "float32", "kernel_regularizer": null}, "name": "lstm"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 16, 7], "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [[["lstm", 0, 0, {}], ["input_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"dtype": "float32", "axis": -1, "trainable": true, "name": "concatenate"}, "name": "concatenate"}, {"inbound_nodes": [[["concatenate", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 71, "activation": "tanh", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "dtype": "float32", "name": "dense", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "name": "dense"}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 71, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "dtype": "float32", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 2, "activation": "tanh", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "dtype": "float32", "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "name": "dense_2"}], "name": "model"}}}, "weightsManifest": [{"paths": ["group1-shard1of1_momentum"], "weights": [{"name": "dense/kernel", "shape": [71, 71], "dtype": "float32"}, {"name": "dense/bias", "shape": [71], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [71, 71], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [71], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [71, 2], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [2], "dtype": "float32"}, {"name": "lstm/kernel", "shape": [96, 256], "dtype": "float32"}, {"name": "lstm/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "lstm/bias", "shape": [256], "dtype": "float32"}, {"name": "time_distributed/kernel", "shape": [2, 2, 16], "dtype": "float32"}, {"name": "time_distributed/bias", "shape": [16], "dtype": "float32"}, {"name": "time_distributed_4/kernel", "shape": [3, 16, 16], "dtype": "float32"}, {"name": "time_distributed_4/bias", "shape": [16], "dtype": "float32"}]}]}